#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.sandbox-2.azurerm_resource_group.sandbox: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2]
azurerm_policy_definition.storage_encryption: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/providers/Microsoft.Authorization/policyDefinitions/enforce-storage-encryption]
azurerm_policy_definition.allowed_vm_sizes: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/providers/Microsoft.Authorization/policyDefinitions/allowed-vm-sizes]
azurerm_policy_definition.require_mfa: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/providers/Microsoft.Authorization/policyDefinitions/require-mfa]
data.azurerm_subscription.current: Reading...
azurerm_cost_anomaly_alert.cost_anomaly_alert: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/providers/Microsoft.CostManagement/scheduledActions/cost-anomaly-alert]
azurerm_policy_definition.allowed_regions: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/providers/Microsoft.Authorization/policyDefinitions/allowed-regions]
module.sandbox-1.azurerm_resource_group.sandbox: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1]
data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1]
module.sandbox-2.azurerm_network_security_group.nsg_public: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Network/networkSecurityGroups/nsg-public]
module.sandbox-2.azurerm_virtual_network.sandbox_vnet: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Network/virtualNetworks/SandboxVNet]
module.sandbox-2.azurerm_network_security_group.nsg_private: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Network/networkSecurityGroups/nsg-private]
module.sandbox-1.azurerm_network_security_group.nsg_public: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Network/networkSecurityGroups/nsg-public]
module.sandbox-1.azurerm_virtual_network.sandbox_vnet: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Network/virtualNetworks/SandboxVNet]
module.sandbox-1.azurerm_network_security_group.nsg_private: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Network/networkSecurityGroups/nsg-private]
module.sandbox-1.azurerm_resource_group_policy_assignment.policies["allowed-regions"]: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Authorization/policyAssignments/allowed-regions-assignment-sandbox-1]
module.sandbox-1.azurerm_resource_group_policy_assignment.policies["allowed-vm-sizes"]: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Authorization/policyAssignments/allowed-vm-sizes-assignment-sandbox-1]
module.sandbox-1.azurerm_resource_group_policy_assignment.policies["require-mfa"]: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Authorization/policyAssignments/require-mfa-assignment-sandbox-1]
module.sandbox-1.azurerm_resource_group_policy_assignment.policies["enforce-storage-encryption"]: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Authorization/policyAssignments/enforce-storage-encryption-assignment-sandbox-1]
module.sandbox-2.azurerm_resource_group_policy_assignment.policies["require-mfa"]: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Authorization/policyAssignments/require-mfa-assignment-sandbox-2]
module.sandbox-2.azurerm_resource_group_policy_assignment.policies["allowed-regions"]: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Authorization/policyAssignments/allowed-regions-assignment-sandbox-2]
module.sandbox-2.azurerm_resource_group_policy_assignment.policies["allowed-vm-sizes"]: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Authorization/policyAssignments/allowed-vm-sizes-assignment-sandbox-2]
module.sandbox-2.azurerm_resource_group_policy_assignment.policies["enforce-storage-encryption"]: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Authorization/policyAssignments/enforce-storage-encryption-assignment-sandbox-2]
module.sandbox-1.azurerm_subnet.public: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Network/virtualNetworks/SandboxVNet/subnets/subnet-public]
module.sandbox-1.azurerm_subnet.private: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Network/virtualNetworks/SandboxVNet/subnets/subnet-private]
module.sandbox-1.azurerm_network_security_rule.deny_private_outbound_all: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Network/networkSecurityGroups/nsg-private/securityRules/Deny-All-Outbound]
module.sandbox-2.azurerm_network_security_rule.deny_private_outbound_all: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Network/networkSecurityGroups/nsg-private/securityRules/Deny-All-Outbound]
module.sandbox-2.azurerm_subnet.public: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Network/virtualNetworks/SandboxVNet/subnets/subnet-public]
module.sandbox-2.azurerm_subnet.private: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Network/virtualNetworks/SandboxVNet/subnets/subnet-private]
module.sandbox-1.azurerm_subnet_network_security_group_association.private_nsg_association: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Network/virtualNetworks/SandboxVNet/subnets/subnet-private]
module.sandbox-1.azurerm_subnet_network_security_group_association.public_nsg_association: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Network/virtualNetworks/SandboxVNet/subnets/subnet-public]
module.sandbox-1.azurerm_network_security_rule.allow_private_to_public: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-1/providers/Microsoft.Network/networkSecurityGroups/nsg-private/securityRules/Allow-Private-to-Public]
module.sandbox-2.azurerm_subnet_network_security_group_association.private_nsg_association: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Network/virtualNetworks/SandboxVNet/subnets/subnet-private]
module.sandbox-2.azurerm_subnet_network_security_group_association.public_nsg_association: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Network/virtualNetworks/SandboxVNet/subnets/subnet-public]
module.sandbox-2.azurerm_network_security_rule.allow_private_to_public: Refreshing state... [id=/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1/resourceGroups/sandbox-2/providers/Microsoft.Network/networkSecurityGroups/nsg-private/securityRules/Allow-Private-to-Public]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.sandbox-1.azurerm_consumption_budget_subscription.sandbox_budget will be created
  + resource "azurerm_consumption_budget_subscription" "sandbox_budget" {
      + amount          = 500
      + etag            = (known after apply)
      + id              = (known after apply)
      + name            = "sandbox-budget"
      + subscription_id = "/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1"
      + time_grain      = "Monthly"

      + filter {
          + dimension {
              + name     = "ResourceGroupName"
              + operator = "In"
              + values   = [
                  + "sandbox-1",
                ]
            }
        }

      + notification {
          + contact_emails = [
              + "alerts@company.ch",
            ]
          + contact_groups = []
          + contact_roles  = []
          + enabled        = true
          + operator       = "GreaterThan"
          + threshold      = 50
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = [
              + "alerts@company.ch",
            ]
          + contact_groups = []
          + contact_roles  = []
          + enabled        = true
          + operator       = "GreaterThan"
          + threshold      = 75
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = [
              + "alerts@company.ch",
            ]
          + contact_groups = []
          + contact_roles  = []
          + enabled        = true
          + operator       = "GreaterThan"
          + threshold      = 90
          + threshold_type = "Actual"
        }

      + time_period {
          + end_date   = "2026-01-01T00:00:00Z"
          + start_date = (known after apply)
        }
    }

  # module.sandbox-2.azurerm_consumption_budget_subscription.sandbox_budget will be created
  + resource "azurerm_consumption_budget_subscription" "sandbox_budget" {
      + amount          = 500
      + etag            = (known after apply)
      + id              = (known after apply)
      + name            = "sandbox-budget"
      + subscription_id = "/subscriptions/c0205fad-0534-4e71-aecf-d08d0ddea1c1"
      + time_grain      = "Monthly"

      + filter {
          + dimension {
              + name     = "ResourceGroupName"
              + operator = "In"
              + values   = [
                  + "sandbox-2",
                ]
            }
        }

      + notification {
          + contact_emails = [
              + "alerts@company.ch",
            ]
          + contact_groups = []
          + contact_roles  = []
          + enabled        = true
          + operator       = "GreaterThan"
          + threshold      = 50
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = [
              + "alerts@company.ch",
            ]
          + contact_groups = []
          + contact_roles  = []
          + enabled        = true
          + operator       = "GreaterThan"
          + threshold      = 75
          + threshold_type = "Actual"
        }
      + notification {
          + contact_emails = [
              + "alerts@company.ch",
            ]
          + contact_groups = []
          + contact_roles  = []
          + enabled        = true
          + operator       = "GreaterThan"
          + threshold      = 90
          + threshold_type = "Actual"
        }

      + time_period {
          + end_date   = "2026-01-01T00:00:00Z"
          + start_date = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ItsKev, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*